CREATE TABLE categories (
    id SERIAL PRIMARY KEY,
    name VARCHAR(100) NOT NULL,
    description TEXT
);

INSERT INTO categories (name, description) VALUES
    ('Допомога з покупками', 'Допомога з покупками продуктів та інших товарів'),
    ('Транспортування', 'Допомога з транспортуванням'),
    ('Технічна підтримка', 'Допомога з технічними питаннями'),
    ('Домашні справи', 'Допомога з домашніми справами'),
    ('Супровід', 'Супровід до лікаря, установ тощо'),
    ('Інше', 'Інші види допомоги');